
## Plan Result (prod)




<pre><code>Plan: 34 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]
  * azurerm_dashboard_grafana.dashboard-grafana[0]
  * azurerm_dashboard_grafana.dashboard-grafana10[0]
  * azurerm_key_vault_secret.DB-URL[0]
  * azurerm_postgresql_flexible_server_configuration.extensions[0]
  * azurerm_role_assignment.admin[0]
  * azurerm_role_assignment.admin-grafana9[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_aat_access-grafana9[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0]
  * azurerm_role_assignment.app_insights_dcd_cnp_prod_access-grafana9[0]
  * azurerm_role_assignment.editors[0]
  * azurerm_role_assignment.editors-grafana9[0]
  * azurerm_role_assignment.more_viewers[0]
  * azurerm_role_assignment.more_viewers-grafana9[0]
  * azurerm_role_assignment.platops[0]
  * azurerm_role_assignment.platops-grafana9[0]
  * azurerm_role_assignment.readers[0]
  * azurerm_role_assignment.readers-grafana9[0]
  * azurerm_role_assignment.viewers[0]
  * azurerm_role_assignment.viewers-grafana9[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;dashboard&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana00&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana01&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1000&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1001&#34;]
  * module.postgresql[0].azurerm_resource_group.rg[0]
  * module.postgresql[0].null_resource.set-user-permissions-additionaldbs[&#34;dashboard&#34;]
  * module.postgresql[0].random_password.password
  * module.postgresql[0].terraform_data.trigger_password_reset
* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] will be created
  + resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
      + amount            = 500
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "grafana-budget-alert"
      + resource_group_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod"
      + time_grain        = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceId"
              + operator = "In"
              + values   = (known after apply)
            }
        }

      + notification {
          + contact_emails = []
          + contact_groups = [
              + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/microsoft.insights/actionGroups/DTSSE_Alert_prod",
            ]
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 90
          + threshold_type = "Forecasted"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2024-10-01T00:00:00Z"
        }
    }

  # azurerm_dashboard_grafana.dashboard-grafana[0] will be created
  + resource "azurerm_dashboard_grafana" "dashboard-grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "westeurope"
      + name                                   = "dtsse-grafana-prod"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "dtsse-prod"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
      + zone_redundancy_enabled                = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_dashboard_grafana.dashboard-grafana10[0] will be created
  + resource "azurerm_dashboard_grafana" "dashboard-grafana10" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "uksouth"
      + name                                   = "dtsse-grafana10-prod"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "dtsse-prod"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
      + zone_redundancy_enabled                = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_key_vault_secret.DB-URL[0] will be created
  + resource "azurerm_key_vault_secret" "DB-URL" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.KeyVault/vaults/dtsse-prod"
      + name                    = "db-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server_configuration.extensions[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "hypopg,plpgsql,pg_stat_statements,pg_buffercache"
    }

  # azurerm_role_assignment.admin[0] will be created
  + resource "azurerm_role_assignment" "admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c2c7af6e-4427-45c2-8ca8-03b8ebe2d11f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.admin-grafana9[0] will be created
  + resource "azurerm_role_assignment" "admin-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c2c7af6e-4427-45c2-8ca8-03b8ebe2d11f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_aat_access[0] will be created
  + resource "azurerm_role_assignment" "app_insights_dcd_cnp_aat_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_aat_access-grafana9[0] will be created
  + resource "azurerm_role_assignment" "app_insights_dcd_cnp_aat_access-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access[0] will be created
  + resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.app_insights_dcd_cnp_prod_access-grafana9[0] will be created
  + resource "azurerm_role_assignment" "app_insights_dcd_cnp_prod_access-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.editors[0] will be created
  + resource "azurerm_role_assignment" "editors" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.editors-grafana9[0] will be created
  + resource "azurerm_role_assignment" "editors-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.more_viewers[0] will be created
  + resource "azurerm_role_assignment" "more_viewers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d0f6d0b1-d067-40ac-80b4-2ec5bc5fd817"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.more_viewers-grafana9[0] will be created
  + resource "azurerm_role_assignment" "more_viewers-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d0f6d0b1-d067-40ac-80b4-2ec5bc5fd817"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.platops[0] will be created
  + resource "azurerm_role_assignment" "platops" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.platops-grafana9[0] will be created
  + resource "azurerm_role_assignment" "platops-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.readers[0] will be created
  + resource "azurerm_role_assignment" "readers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94f8f711-f032-4fbe-a878-6fc519358d88"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.readers-grafana9[0] will be created
  + resource "azurerm_role_assignment" "readers-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94f8f711-f032-4fbe-a878-6fc519358d88"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.viewers[0] will be created
  + resource "azurerm_role_assignment" "viewers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98bbe6e9-2878-4bc6-b602-30ad18b6e934"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.viewers-grafana9[0] will be created
  + resource "azurerm_role_assignment" "viewers-grafana9" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "98bbe6e9-2878-4bc6-b602-30ad18b6e934"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Viewer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.postgresql[0].data.azuread_group.db_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "db_admin" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations SC"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.postgresql[0].data.azuread_service_principal.mi_name[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_service_principal" "mi_name" {
      + account_enabled               = (known after apply)
      + alternative_names             = (known after apply)
      + app_role_assignment_required  = (known after apply)
      + app_role_ids                  = (known after apply)
      + app_roles                     = (known after apply)
      + application_id                = (known after apply)
      + application_tenant_id         = (known after apply)
      + client_id                     = (known after apply)
      + description                   = (known after apply)
      + display_name                  = (known after apply)
      + feature_tags                  = (known after apply)
      + features                      = (known after apply)
      + homepage_url                  = (known after apply)
      + id                            = (known after apply)
      + login_url                     = (known after apply)
      + logout_url                    = (known after apply)
      + notes                         = (known after apply)
      + notification_email_addresses  = (known after apply)
      + oauth2_permission_scope_ids   = (known after apply)
      + oauth2_permission_scopes      = (known after apply)
      + object_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + preferred_single_sign_on_mode = (known after apply)
      + redirect_uris                 = (known after apply)
      + saml_metadata_url             = (known after apply)
      + saml_single_sign_on           = (known after apply)
      + service_principal_names       = (known after apply)
      + sign_in_audience              = (known after apply)
      + tags                          = (known after apply)
      + type                          = (known after apply)
    }

  # module.postgresql[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.postgresql[0].data.azurerm_subnet.pg_subnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "pg_subnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "postgresql"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "cft-prod-network-rg"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "cft-prod-vnet"
    }

  # module.postgresql[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "dtsse-dashboard-flexdb-prod"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "dtsse-dashboard-flexdb-data-prod"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = (known after apply)
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + principal_name      = "DTS Platform Operations SC"
      + principal_type      = "Group"
      + resource_group_name = "dtsse-dashboard-flexdb-data-prod"
      + server_name         = "dtsse-dashboard-flexdb-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "dtsse-dashboard-flexdb-data-prod"
      + server_name         = "dtsse-dashboard-flexdb-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["dashboard"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "dashboard"
      + server_id = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana00"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "grafana00"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana01"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "grafana01"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1000"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "grafana1000"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1001"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "grafana1001"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.postgresql[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dtsse-dashboard-flexdb-data-prod"
      + tags     = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
    }

  # module.postgresql[0].null_resource.set-user-permissions-additionaldbs["dashboard"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS JIT Access dtsse DB Reader SC"
          + "force_trigger"  = null
          + "name"           = "dtsse-dashboard-flexdb"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql[0].random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql[0].terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 34 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":192,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->